Revit 2027 API
Rebar.Volume Property
 The volume of an individual bar multiplied by Quantity.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Volume { get; }
Public ReadOnly Property Volume As Double
	Get
public:
property double Volume {
	double get ();
}
member Volume : float with get
Property Value
Double
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace